Revit 2024 API
WireType.Conduit Property
 The conduit type of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireConduitType Conduit { get; set; }
Visual Basic
Public Property Conduit As WireConduitType
	Get
	Set
Visual C++
public:
property WireConduitType^ Conduit {
	WireConduitType^ get ();
	void set (WireConduitType^ value);
}
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace